{
  "stories": [
    {
      "title": "The Answer",
      "author": "Frederic Brown",
      "rating": 1,
      "summary": "All AI of billions of planets in the universe is finally connected. The engineer asks if God exists. The answer comes.",
      "spoiler": false,
      "liked": [
        "Ninety-six billion inhabited and interconnected planets is an intereseting idea",
        "It's moralistic enough that we can use the name 'Dwar Ev' for pretentious tech bros, not sure anyone will catch the reference though"
      ],
      "disliked": [
        "The ending is unsurprising, nearly obvious. Maybe it's been influential enough back then, in a way that makes it nothing to write home about today (yet here I am!)"
      ]
    },
    {
      "title": "The Nine Billion Names of God",
      "author": "Arthur C. Clarke",
      "rating": 3,
      "summary": "A group of Tibetan monks who use a computer to list all the possible names of God, and speed up a process they've been doing for millenia. Two engineers overseeing the project initially think it’s absurd. Will something happen when the list is completed?",
      "spoiler": true,
      "liked": [
        "The idea of 9 billion names for God (I was expecting it to be the name of humans walking on earth)",
        "The fact that monks were requesting a computer to speed up their work",
        "The engineers supporting them becoming afraid",
        "Wikipedia linked 'Brute force attack' to this short story entry"
      ],
      "disliked": [
        "I got anxious to see the story develop and the initial 'technical' discussion bored me",
        "The way English literature marks dialogues is confusing"
      ]
    },
    {
      "title": "The Last Question",
      "author": "Isaac Asimov",
      "rating": 5,
      "summary": "The Last Question follows multiple generations as humanity continually asks the supercomputer Multivac how to reverse the entropy of the universe and prevent its eventual heat death. Over the course of millions of years, humans and Multivac evolve, and the question is asked one last time..",
      "spoiler": false,
      "liked": [
        "Progressive Recursion",
        "Humans evolve but the essential question is still the same",
        "Happy-ish dystopia",
        "The answer",
        "Circular ending",
        "I liked (but also disliked) how people and technology become so integrated to the point it gets.",
        "Questions:\nWhat are we willing to give to delay the inevitable?",
        "Is the pursuit of ultimate knowledge an end in itself?"
      ],
      "disliked": ["N/A"]
    },
    {
      "title": "[S04E01] The Way of the Warrior-Part I",
      "author": "Deep Space 9",
      "rating": 4,
      "summary": "Sisko becomes uncomfortable when the Klingons station a task force to help defend against the Dominion. Worf is summoned to find out their true intentions.",
      "spoiler": false,
      "liked": [
        "Finally some action",
        "Worf gets conflicted, and decides to keep his honour when that's not valued by the Federation",
        "Garak saving his own skin in an honourable way",
        "Odo talking to Bashir, and I realized he's the one at most danger and my heart broke for him"
      ],
      "disliked": ["N/A"]
    },
    {
      "title": "[S04E02] The Visitor",
      "author": "Deep Space 9",
      "rating": 5,
      "summary": "Melanie, an aspiring writer, wants to know why Jake Sisko stopped writing at 40. Jake tells how his father died in an accident and then suddenly reappeared.",
      "spoiler": true,
      "liked": [
        "Starts with an old Jake, in deep emotional pain. Up to now Jake was still a child and has started to show some personality, and it's quite a jump to see him as old man. This jump was emotional per se",
        "Sisko 'dies' many times for Jake",
        "At some point, Jake is older than his dad",
        "Sisko is extremely loving at every appearance",
        "Jake returns to writing out of love for his father, knowing he'll see him one last time. He wants his dad to be proud of him when they depart",
        "When Jake and Sisko are separated, Jake painfully changes the whole course of his life to save his dad at the cost of himself; Sisko is heartbroken and selflessly insists with Jake to get back to writing, and go on with his life.",
        "Jake is not selfless, he's sacrificial. He was the one in a position to sacrifice and he did, despite of his father's protests. The fact that he had stories to show to his father before the final sacrificing was like 'I did what you asked of me, but I still have this one more thing to do'",
        "It's beautiful HOW MUCH LOVE there is in this episode."
      ],
      "disliked": ["Absolutely nothing. This is beautiful writing."]
    },
    {
      "title": "Computers Don't Argue",
      "author": "Gordon R. Dickson",
      "rating": 4,
      "summary": "A man gets caught in a bureaucratic nightmare after receiving the wrong book from a book club and trying to resolve the issue, only to be increasingly harassed by automated systems that escalate the situation more and more",
      "spoiler": false,
      "liked": [
        "Enjoyable tragicomedy, in the form of exchanged letters",
        "Really liked the absurdity of the situation, and the escalation from one type of infraction to another is funny",
        "Wikipedia linked 'computer says no' and 'garbage in, garbage out'. I wish there was a shorthand for QA issues too :P",
        "It was interesting that the author could imagine a context where computers would take all the decisions, but people would still write letters"
      ],
      "disliked": ["Exchanged letters format is fine, but the headers were breaking the flow too much"]
    },
    {
      "title": "They're Made out of Meat",
      "author": "Terry Bisson",
      "rating": 4,
      "summary": "A pair of extraterrestrials are baffled by the idea of thinking, talking meat that appears to live in this far-away corner of the universe. Utterly dumbfounded, they ponder over the finding and debate what they should do with the discovery.",
      "spoiler": false,
      "liked": [
        "Really fun satire, a delight to read, made me sincerely laugh.",
        "The case of aliens being astonished by the very nature of humans -  not by their actions, morals, or values - is a really cool approach. It's nothing that we humans don't do, but seeing this applied to us is very funny and insightful."
      ],
      "disliked": ["N/A"]
    },
    {
      "title": "A Sound of Thunder",
      "author": "Ray Bradbury",
      "rating": 4,
      "summary": "A group of wealthy man pay to travel back to hunt a prehistoric game. The hunters are ordered to follow very strict rules to avoid unforeseeable consequences. What could go wrong?",
      "spoiler": false,
      "liked": [
        "It is suspected that this short story inspired the naming for the butterfly effect",
        "This is beautiful. I love how the writing is grandiose to match the enormity of the game and the seriousness of the stakes.",
        "To my surprise, I like the lenghy description of the T-Rex. It creates the proper ambiance for Eckels's breakdown",
        "So many good points. How wealthy consumers don't care about the true costs of their greed and arrogance; how experiences we long for can become terrifying once we grasp their seriousness, and there's no coming back; how things we might enjoy take a very differnt turn once their true nature is revealed etc",
        "The use of 'a sound of thunder' to refer to the arrival of the T-Rex and the final event in the story is absolutely beautiful."
      ],
      "disliked": ["It gets a bit too emphatic on why they can't deviate from the plan, but that's very minor. No strong reason for it not be a 5-star review, I might change it on a re-read."],
      "writing_notes": [
        "I love that the hunters got disgustinly covered in blood after the kill, and that they throwed up afterwards, and refused to take a picture",
        "Nice build up of the tension that something was wrong, but he couldn't put a finger on it"
      ]
    },
    {
      "title": "All Summer in a Day",
      "author": "Ray Bradbury",
      "rating": 4,
      "summary": "In rain-stricken Venus, the Sun only shines for one hour once in seven years. Schoolchildren anxiously await to see the Sun for the first time they can remember. Margot, an Earth-born child with vivid memories of clear sunny days, is among them.",
      "spoiler": false,
      "liked": [
        "I liked how the sci-fi element is a very interesting and poignant backdrop, rather than what drives story forward. Of course it elicits very strong feelings immediately and makes the outcome as dramatic as it can be. Still, it's a very human tale told, by chance, in Venus.",
        "The story is haunting.",
        "Little trivia: this sotory and Lord of the Flies were released in the same year."
      ],
      "disliked": ["The story loses a lot of its punch if someone has given you spoilers (which was my case)."]
    },
    {
      "title": "The Cure for Everything",
      "author": "Severna Parks",
      "rating": 2,
      "summary": "Maria, a linguist working at a government institution to integrate refugee indigenous peoples into the larger society, learns about a tribe with a genetic mutation that could potentially cure any disease, including her own condition",
      "spoiler": false,
      "liked": [
        "The story makes you intrigued about the protagonist's looks, and that it's indeed relevant to the story.",
        "It's cool that the protagonist is mistaken by a powerful spirit - it's a shame that doesn't bring any consequence to the story."  
      ],
      "disliked": [
        "The plot ideas are strong, but are underdeveloped. I particularly disliked that the indigenous people have no depth.",
        "The protagonist is portrayed in a very matter-of-fact way, which weakens the perception of her supposedly strong values.", 
        "The protagonist's frustrated wish for having kids seems to come out of the blue, and is not developed enough to support her moral dilemma, so it and doesn't justify how the story ends. The story ending even felt gross because of that."
      ]
    },
    {
      "title": "Kin",
      "author": "Bruce McAllister",
      "rating": 5,
      "summary": "A young boy wants to hire an alien assassin.",
      "spoiler": true,
      "liked": [
        "I was immediately hooked by the idea of a boy hiring an assassin. And yet, what a delicate, touching story!",
        "The description of the alien builds up tension, especially because the boy is very aware of the dangers of that anatomy. The small space they share, and the secrecy of the meeting hightens the tension a notch.",
        "The boy has striking intelligence and resourcefulness, with some contrasting naivety of late childhood - but it was well written enough to be believable.",
        "The alien's restrained, calculated and respectful curiosity towards the boy on their first meeting is quite intriguing.",
        "When meeting with Ortega-Mambay, the way the alien presents the boy's case is like a reprimand on the man's lost humanity.",
        "The second meeting with the boy is beautiful! The way both are aware and prepared for cultural differences, and suprised by similarites... And the boy making that meaningful gesture, whoa! It's remarkable to have a boy a bond with an ALIEN ASSASSIN.",
        "I thought after the news that his sister would live, the story would be over, and I'd be content with that. However, what follows is even better. It gives the story title Kin (is the boy's name a wordplay with it?) a whole new and deeper, enchanting meaning."
      ],
      "disliked": [
        "What I disliked was not about the story. I first saw Kin in an episode of LeVar Burton reads. At the end, he shares what he likes about the story and... I was quite surprised and disappointed? It's like he didn't catch the paramount point of the story, the kinship between almost opposite beings?!"
      ]
    },
    {
      "title": "The Egg",
      "author": "Andy Weir",
      "rating": 3,
      "summary": "A man dies and discovers that he'd been reincarnated many times before, and that he's soon to be reincarnated once more, leading to quite a few existential questions.",
      "spoiler": false,
      "liked": [
        "The comment about a car accident: \"Nothing particularly remarkable, but fatal nonetheless.\"",
        "The ideas are really interesting and I like how the man was a bit disoriented during most of it (I'm not giving spoilers.)"
      ],
      "disliked": [
        "The preachyness turned off my brain, the pace turned off my imagination."
      ],
      "writing_notes": [
        "What if I try to rewrite this story as an exercise? Oh the audacity",
      ]
    }
  ]
}
